//Вывести на одной строке числа 1, 13, 49 с одним пробеломмежду ними
#include <iostream>
using namespace std;

int main ()
{
	int firstNumber = 1;

	int secondNumber = 13;

	int thirdNumber = 49;

	cout << firstNumber << " "<< secondNumber << " " << thirdNumber << endl;
	return 0;
}